views/salary/index.php

SELECT * FROM `staff`
---
            'filter' =>  Select2::widget([
                'model' => $model,
                'attribute' => 'id_staff',
                'data' => ArrayHelper::map(Staff::find()->asArray()->all(), 'id_staff', 'last_name'),

SELECT * FROM `locations`
---
            'filter' =>  Select2::widget([
                'model' => $model,
                'attribute' => 'id_location',
                'data' => ArrayHelper::map(Locations::find()->asArray()->all(), 'id_location', 'location'),