controllers/FilesController.php

    public function actionDownloadFiles()
    {
        $savePath = '';

        $downloadType = Yii::$app->request->post('download_type');
        $filename = Yii::$app->request->post('filename');
        $data = Yii::$app->request->post();
        $id_staff = $data['FilesSearch']['id_staff'];
        $selectedFilesIdsNotDecoded = json_decode(Yii::$app->request->post('selectionArray'));
        $selectedFilesIds = [];

        if (!empty($id_staff)) {
            if (!empty($selectedFilesIdsNotDecoded)) {
                foreach ($selectedFilesIdsNotDecoded as $notDecodedFileId) {
                    if (current(get_object_vars($notDecodedFileId)) == true) {
                        $selectedFilesIds[] = key(get_object_vars($notDecodedFileId));
                    }
                }
                asort($selectedFilesIds);


                $selectedFiles = Files::find();

                foreach ($selectedFilesIds as $fileId) {
                    $selectedFiles->orWhere(['id' => $fileId]);
                }

                $selectedFiles = $selectedFiles->all();
---
SELECT * FROM `files` WHERE (`id`=6621) OR (`id`=6623)

            'comment' => 'Объединение из docx',
        ];

        $model = Files::createFiles($data);
---
INSERT INTO `files` (`id_staff`, `type`, `datetime`, `file`, `header`, `comment`) VALUES (4, 'pdf', '2020-08-23 13:07:28', '/uploads/FilesFiles/MergedPDF/15f4207a021f91.pdf', '222', 'Объединение из docx')