controllers/SalaryController.php

    public function actionIndex()
    {
        if (Yii::$app->user->isGuest) {
            return $this->goHome();
        }
        $user = new User();

        //   echo '<pre>';
        //   VarDumper::dump($user->getPermissions());

        // your default model and dataProvider generated by gii
        $searchModel = new StaffSalary();
//
//       VarDumper::dump(Yii::$app->request->isAjax);
//       VarDumper::dump(Yii::$app->request->isPost);
//       VarDumper::dump(Yii::$app->request);
        $hasEditable = Yii::$app->request->post('hasEditable');

        $countSalaries = StaffSalary::find()
            ->where(['or', ['time_job_start_approve' => 0], ['time_job_end_approve' => 0], ['position_approve' => 0]])
            ->orWhere(['or', ['time_job_start_approve' => null], ['time_job_end_approve' => null], ['position_approve' => null]])
---
SELECT COUNT(*) FROM `staff_salary` WHERE ((`time_job_start_approve`=0) OR (`time_job_end_approve`=0) OR (`position_approve`=0)) OR ((`time_job_start_approve` IS NULL) OR (`time_job_end_approve` IS NULL) OR (`position_approve` IS NULL))

    public function actionGenerateRko()
    {
        Yii::$app->getSession()->removeAllFlashes('warning');

        $errors = [];
        $rkoFilePaths = [];

        $dateStartWithoutTime = Yii::$app->request->post('date_start');
        $dateEndWithoutTime = Yii::$app->request->post('date_end');

        $dateStart = $dateStartWithoutTime . ' ' . '00:00:00';
        $dateEnd = $dateEndWithoutTime . ' ' . '23:59:59';

        $query = new \yii\db\Query;

        $staff = $query
            ->select('staff.*')
            ->from(['staff', 'staff_salary'])
            ->where('staff.id_staff=staff_salary.id_staff')
            ->andWhere([
                '>=', 'time_job_end', $dateStart
            ])
            ->andWhere([
                '<=', 'time_job_end', $dateEnd
            ])
            ->groupBy('staff.id_staff')
            ->all();
---
SELECT `staff`.* FROM `staff`, `staff_salary` WHERE (staff.id_staff=staff_salary.id_staff) AND (`time_job_end` >= '2020-07-01 00:00:00') AND (`time_job_end` <= '2020-12-31 23:59:59') GROUP BY `staff`.`id_staff`