controllers/SiteController.php

    public function actionGrid()
    {
        if (Yii::$app->user->isGuest) {
            return $this->goHome();
        }
        $user = new User();

     //   echo '<pre>';
     //   VarDumper::dump($user->getPermissions());

        // your default model and dataProvider generated by gii
        $searchModel = new StaffSalary();
//
//       VarDumper::dump(Yii::$app->request->isAjax);
//       VarDumper::dump(Yii::$app->request->isPost);
//       VarDumper::dump(Yii::$app->request);
        $hasEditable = Yii::$app->request->post('hasEditable');

        if (Yii::$app->request->isAjax && !$hasEditable) {

            $id_salary = Yii::$app->request->post('id_salary');
            $post = ['StaffSalary' => $_POST];
            $model = StaffSalary::findOne($id_salary);
---
SELECT * FROM `staff_salary` WHERE `id_salary` IS NULL