views/site/grid.php

SELECT * FROM `staff`
---
            'filter' =>  Select2::widget([
                'model' => $model,
                'attribute' => 'id_staff',
                'data' => ArrayHelper::map(Staff::find()->asArray()->all(), 'id_staff', 'last_name'),

SELECT * FROM `staff`
---
                    if ($model->is_deleted == true) {
                        return '<span style="text-decoration: line-through;">' . $model->staff->last_name . ' ' .$model->staff->first_name . '</span>';
                    } else {
                        return Html::a($model->staff->last_name . ' ' .$model->staff->first_name,'?r=site/grid&id_staff='.$model->id_staff);

SELECT * FROM `locations`
---
            'attribute' => 'Место',
            'noWrap' => true,
            'format' => 'raw',
            'filter' =>  Select2::widget([
                'model' => $model,
                'attribute' => 'id_location',
                'data' => ArrayHelper::map(Locations::find()->asArray()->all(), 'id_location', 'location'),
                'theme' => \kartik\widgets\Select2::THEME_BOOTSTRAP,
                'initValueText' => $model->type,
                'options' => [
                    'class' => 'form-control',
                    'placeholder' => 'Выберите значение'
                ],
                'pluginOptions' => [
                    'allowClear' => true,
                    'selectOnClose' => true,
                ]
            ]),