views/staff/index.php

        <?=  $this->render('_search', ['model' => $searchModel]); ?>
    </div>
    <?php
    $gridColumn = [
        ['class' => 'yii\grid\SerialColumn'],
        [
            'attribute' => 'id_staff',
            'value' => function($model) {
                    return $model->last_name;
            },
            'filterType' => GridView::FILTER_SELECT2,
            'filter' => \yii\helpers\ArrayHelper::map(\app\models\Staff::find()->asArray()->all(), 'id_staff', 'last_name'),
            'filterWidgetOptions' => [
                'pluginOptions' => ['allowClear' => true],
                'theme' => \kartik\widgets\Select2::THEME_BOOTSTRAP,
            ],
            'filterInputOptions' => ['placeholder' => 'Введите фамилию', 'id' => 'grid-staff-search-id_staff'],
            'hAlign' => 'center',
            'vAlign' => 'middle',
        ],
        [
            'attribute' => 'first_name',
            'noWrap' => true,
            'format' => 'raw',
---
SELECT * FROM `staff`

            'vAlign' => 'middle',
        ],
        // 'telegram_username',
        [
            'attribute' => 'id_location',
            'label' => 'Название <br>локации',
            'encodeLabel' => false,
            'hAlign' => 'center',
            'vAlign' => 'middle',
            'value' => function($model){
                if ($model->location)
                {return $model->location->location;}
                else
                {return NULL;}
            },
            'filterType' => GridView::FILTER_SELECT2,
            'filter' => \yii\helpers\ArrayHelper::map(\app\models\Locations::find()->asArray()->all(), 'id_location', 'location'),
            'filterWidgetOptions' => [
                'pluginOptions' => ['allowClear' => true],
                'theme' => \kartik\widgets\Select2::THEME_BOOTSTRAP,
            ],
            'filterInputOptions' => ['placeholder' => 'Введите локацию', 'id' => 'grid-staff-search-id_location']
        ],
---
SELECT * FROM `locations`