views/files/index.php

            'hAlign' => 'center',
            'vAlign' => 'middle',
        ],
        [
            'attribute' => 'id_location',
            'label' => 'Локация',
            'hAlign' => 'center',
            'vAlign' => 'middle',
            'value' => function($model){
                if ($model->locations)
                {return $model->locations->location;}
                else
                {return NULL;}
            },
            'filterType' => GridView::FILTER_SELECT2,
            'filter' => \yii\helpers\ArrayHelper::map(\app\models\Locations::find()->asArray()->all(), 'id_location', 'location'),
            'filterWidgetOptions' => [
                'pluginOptions' => ['allowClear' => true],
                'theme' => \kartik\widgets\Select2::THEME_BOOTSTRAP,
            ],
            'filterInputOptions' => ['placeholder' => 'Введите локацию', 'id' => 'grid-files-search-id_location']
        ],
        [
            'attribute' => 'id_staff',
            'label' => 'ФИО',
            'hAlign' => 'center',
            'vAlign' => 'middle',
            'value' => function($model){
                if ($model->staff)
                {return $model->staff->last_name . " " . $model->staff->first_name . " " . $model->staff->second_name;}
                else
                {return NULL;}
            },
            'filterType' => GridView::FILTER_SELECT2,
            'filter' => \yii\helpers\ArrayHelper::map(\app\models\Staff::find()->asArray()->all(), 'id_staff', 'last_name'),
            'filterWidgetOptions' => [
                'pluginOptions' => ['allowClear' => true],
                'theme' => \kartik\widgets\Select2::THEME_BOOTSTRAP,
            ],
            'filterInputOptions' => ['placeholder' => 'Введите фамилию', 'id' => 'grid-files-search-id_staff']
        ],
---
SELECT * FROM `locations` WHERE `id_location`=15
SELECT * FROM `locations`
SELECT * FROM `staff` WHERE `id_staff`=15
SELECT * FROM `staff` WHERE 0=1
SELECT * FROM `staff`