models/Salary.php

SELECT * FROM `staff_salary` WHERE (`id_staff`='118') AND (`time_job_end` >= '2020-07-01 00:00:00') AND (`time_job_end` <= '2020-12-31 23:59:59')
SELECT summ `id_salary` FROM `staff_salary_extras` WHERE ((`id_salary`=12838) OR (`id_salary`=12847) OR (`id_salary`=12409) OR (`id_salary`=13052) OR (`id_salary`=12920) OR (`id_salary`=12941) OR (`id_salary`=12887) OR (`id_salary`=12358) OR (`id_salary`=12448) OR (`id_salary`=12492) OR (`id_salary`=12497) OR (`id_salary`=12578) OR (`id_salary`=12714) OR (`id_salary`=12726) OR (`id_salary`=12790) OR (`id_salary`=12953) OR (`id_salary`=13045)) AND (`summ` != 0)
---
    public static function calculateSalary($id_staff, $dateStart='', $dateEnd='')
    {
        $summ = 0;

        $dateStart = '2020-07-01' . ' ' . '00:00:00';
        $dateEnd = '2020-12-31' . ' ' . '23:59:59';

        $salaries = StaffSalary::find()
            ->where([
                'id_staff' => $id_staff,
            ])
            ->andWhere([
                '>=', 'time_job_end', $dateStart
            ])
            ->andWhere([
                '<=', 'time_job_end', $dateEnd
            ])
            ->all();

>>>>>>> Stashed changes
        $query = ['or'];

        foreach ($salaries as $salary) {
            $query[] = ['id_salary' => $salary->id_salary];
        }

        $extras = StaffSalaryExtras::find()
            ->select('id_salary', 'summ')
            ->where($query)
            ->andWhere([
                '!=', 'summ', 0
            ])
            ->all();