models/User.php

    public function getPermissions()
    {
        return StaffPermissions::findOne(['id_staff' => $this->getId()]);
---
SELECT * FROM `staff` WHERE `id_staff`=548